src/cf/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиЕдиницыИзмерения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <type>
      <types>EnumRef.ТипыИзмеряемыхВеличин</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковокНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <comment>Вес брутто</comment>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Catalogs/НаборыУпаковок/НаборыУпаковок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаборыУпаковок</name>
  <predefined>
    <items>
      <name>БазовыеЕдиницыИзмерения</name>
      <description>Базовые единицы измерения</description>
    </items>
    <items>
      <name>ИндивидуальныйДляНоменклатуры</name>
      <description>Индивидуальный набор для номенклатуры</description>
    </items>
  </predefined>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Catalogs/УпаковкиЕдиницыИзмерения/Forms/ФормаВыбораИзДокументов/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Номенклатура = Параметры.Номенклатура;
	Единица = Номенклатура.Единица;	
	// Заполним дерево
	НС = ДЗУпаковки.ПолучитьЭлементы().Добавить();
	НС.Ссылка = Единица;
	Если Номенклатура.ИспользоватьУпаковки Тогда
		НС = ДЗУпаковки.ПолучитьЭлементы().Добавить();
		НС.Ссылка = "Упаковки";
		Если Номенклатура.НаборУпаковок = Справочники.НаборыУпаковок.ИндивидуальныйДляНоменклатуры Тогда
			ВладелецУпаковок = Номенклатура;
		Иначе
			ВладелецУпаковок = Номенклатура.НаборУпаковок;
		КонецЕсли;
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		                      |ГДЕ
		                      |	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
		                      |	И УпаковкиЕдиницыИзмерения.ПометкаУдаления = ЛОЖЬ
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	УпаковкиЕдиницыИзмерения.Наименование");
		Запрос.УстановитьПараметр("Владелец", ВладелецУпаковок);
		Выб = Запрос.Выполнить().Выбрать();
		Пока Выб.Следующий() Цикл
			НСУпаковка = НС.ПолучитьЭлементы().Добавить();
			НСУпаковка.Ссылка = Выб.Ссылка;
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура Выбрать(Команда)
	ТекСтр = Элементы.ДЗУпаковки.ТекущаяСтрока;
	Если ТекСтр = Неопределено Тогда Возврат КонецЕсли;
	ВыполнитьВыбор(ТекСтр);
КонецПроцедуры

&НаКлиенте
Процедура ДЗУпаковкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыполнитьВыбор(ВыбраннаяСтрока);
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаКлиенте
Процедура ВыполнитьВыбор(Идентификатор)
	ТекСтр = ДЗУпаковки.НайтиПоИдентификатору(Идентификатор);
	Если ТипЗнч(ТекСтр.Ссылка) <> Тип("СправочникСсылка.УпаковкиЕдиницыИзмерения") Тогда Возврат КонецЕсли;
	Если Единица = ТекСтр.Ссылка Тогда
		ОповеститьОВыборе(ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка"));
	Иначе
		ОповеститьОВыборе(ТекСтр.Ссылка);
	КонецЕсли;
КонецПроцедуры	

#КонецОбласти
